[
  {
    "title": "Arctic Sky Explorer",
    "year": "2025",
    "image": "/portfolio/images/arctic-sky-explorer.png",
    "description": "Interactive D3 dashboard for Arctic monitoring stations comparing seasonal daylight hours and surface brightness. Includes metric toggles, seasonal filters, station selection, and hover tooltips to explore NASA MODIS data trends.",
    "url": "https://katiehanni.github.io/arcticskyexplorer/"
  },
  {
    "title": "Bikewatching",
    "year": "2025",
    "image": "/portfolio/images/bikewatching.png",
    "description": "Mapbox + D3 visualization of Boston/Cambridge Bluebikes traffic. Time slider filters departures and arrivals, circle size captures station volume, and color shows directional imbalance across the network.",
    "url": "https://katiehanni.github.io/bikewatching/"
  },
  {
    "title": "OCR Confidence Optimization",
    "year": "2025",
    "image": "/portfolio/images/newplot.png",
    "description": "Optimizing OCR confidence thresholds — balancing automation accuracy and human review cost using Python. Advanced statistical analysis to minimize manual review while maintaining high accuracy standards.",
    "url": "https://github.com/kathehann/ocr-epic-confidence-optimization"
  },
  {
    "title": "Tastes Like Data: Baked Goods Classifier",
    "year": "2024",
    "image": "/portfolio/images/newplot-2.png",
    "description": "A machine learning project analyzing 83,782 recipes from Food.com to classify baked goods using nutritional data. Features exploratory data analysis, statistical inference, and Random Forest modeling with 82.4% accuracy.",
    "url": "https://github.com/kathehann/baked-goods-classifier"
  },
  {
    "title": "Hippocampus Segmentation",
    "year": "2024",
    "image": "/portfolio/images/Figure_6.png",
    "description": "Collaborative research project using Segment Anything Model (SAM) for automated hippocampus segmentation in medical imaging. Features blood vessel detection, training databases, and advanced computer vision techniques for neuroscience applications.",
    "url": "https://github.com/kathehann/hippocampus-segmentation"
  },
  {
    "title": "Fast Food Unwrapped",
    "year": "2024",
    "image": "/portfolio/images/Unknown.png",
    "description": "A comprehensive analysis of fast food nutrition data exploring patterns in calories, fat content, and nutritional composition across major restaurant chains.",
    "url": "https://github.com/kathehann/fast-food-analysis"
  }
]
